Revit 2024 API
BuiltInFailures.ElectricalFailures.AllSlotsOnPanelOccupied Property
 All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AllSlotsOnPanelOccupied { get; }
Visual Basic
Public Shared ReadOnly Property AllSlotsOnPanelOccupied As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AllSlotsOnPanelOccupied {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace